# Lab - Implement DHCPv4

### Topology

![topology](lab_05_topology.png)

### Addressing Table

![address_table](lab_05_addressing.png)


### Vlan Table

![vlan_table](lab_05_vlans.png)

# Цели

+ **Часть 1: Построение сети и настройка базовых параметров устройств**
+ **Часть 2: Настройка и проверка двух DHCPv4-серверов на R1**
+ **Часть 3: Настройка и проверка DHCP Relay на R2**

### **Предыстория / Сценарий**

Протокол динамической конфигурации хостов **(DHCP)** — это сетевой протокол, который позволяет сетевым администраторам управлять и автоматизировать назначение IP-адресов. Без **DHCP** для **IPv4** администратору приходится вручную назначать и настраивать IP-адреса, предпочтительные DNS-серверы и шлюзы по умолчанию. По мере роста сети это становится административной проблемой, особенно когда устройства перемещаются из одной внутренней сети в другую.

В данном сценарии компания увеличила свои масштабы, и сетевые администраторы больше не могут вручную назначать IP-адреса устройствам. **Наша задача** — настроить маршрутизатор **R1** для назначения IPv4-адресов в двух разных подсетях.

### Необходимые ресурсы

Я сделал эту лабораторную работу в EVE-NG, и в ней я использовал следующие устройства:

+ 2x Cisco vIOS Router
+ 2x Cisco vIOS Switch
+ 2x Virtual PC (VPCS)

## Instruction

## - **Часть 1: Построение сети и настройка базовых параметров устройств**

В **части 1** мы создадим топологию сети и настроим базовые параметры на хостах **PC-A**, **PC-B** и коммутаторах.

**Шаг 1**: Установим схему адресации

Разделим сеть **192.168.1.0/24** на подсети, чтобы удовлетворить следующие требования:

**a.** Одна подсеть, **«Подсеть A»**, поддерживающая **58 хостов** (клиентский VLAN на R1).

**Подсеть A:**
```
192.168.1.0/26 (.1 - 63)
```
Запишим первый IP-адрес в таблице адресации для R1 G0/1.100. Запишим второй IP-адрес в таблице адресации для S1 VLAN 200 и укажем соответствующий шлюз по умолчанию.

**b.** Одна подсеть, **«Подсеть B»**, поддерживающая **28 хостов** (Management VLAN на R1).

**Подсеть B:**
```
192.168.1.64/27 (.65-.95)
```
Запишим первый IP-адрес в таблице адресации для **R1 G0/1.200**. Запишим второй IP-адрес в таблице адресации для **S1 VLAN 1** и укажем соответствующий шлюз по умолчанию.

**c.** Одна подсеть, **«Подсеть C»**, поддерживающая **12 хостов** (клиентская сеть на **R2**).

**Подсеть C:**
```
192.168.1.96/28 (.97-.111)
```
Запишим первый IP-адрес в таблице адресации для **R2 G0/1**.

## **Шаг 2: Подключите сеть согласно топологии**

Подключите устройства, как показано на диаграмме топологии, и соедините их кабелями.

## **Шаг 3: Настройте базовые параметры для каждого маршрутизатора**

a. Присвойте маршрутизатору имя устройства.
```
hostname R1
```
b. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора переводить неправильно введенные команды, как будто это имена хостов.

```
no ip domain-lookup
```

c. Установите class как привилегированный EXEC пароль (шифрованный).

```
R1(config)# enable secret class
```

d. Установите cisco как пароль консоли и включите авторизацию входа.

```
R1(config)# line console 0
R1(config-line)# password cisco
R1(config-line)# login
```

e. Установите cisco как пароль VTY и включите авторизацию входа.

```
R1(config)# line vty 0 4
R1(config-line)# password cisco
R1(config-line)# login
```

f. Зашифруйте пароли в открытом виде.

```
R1(config)# service password-encryption
```

g. Создайте баннер, предупреждающий всех, кто получает доступ к устройству, что несанкционированный доступ запрещен.

```
R1(config)# banner motd $ Authorized Users Only! $
```

h. Сохраните текущую конфигурацию (running configuration) в файл начальной конфигурации (startup configuration).

```
R1# copy running-config startup-config
```

i. Установите на маршрутизаторе текущее время и дату.

```
R1# clock set 15:30:00 27 Aug 2019
```

## **Шаг 4: Настройка межвлановой маршрутизации на R1**

a. Активируйте интерфейс G0/0/1 на маршрутизаторе.

```
R1(config)# interface g0/1
R1(config-if)# no shutdown
R1(config-if)# exit
```

b. Настройте подинтерфейсы для каждого VLAN в соответствии с таблицей адресации IP. Все подинтерфейсы используют инкапсуляцию 802.1Q и получают первый доступный адрес из пула IP-адресов, который вы рассчитали. Убедитесь, что подинтерфейс для нативного VLAN не имеет назначенного IP-адреса. Добавьте описание для каждого подинтерфейса.

```
R1(config)# interface g0/1.100
R1(config-subif)# description Client VLAN
R1(config-subif)# encapsulation dot1q 100
R1(config-subif)# ip address 192.168.1.1 255.255.255.192
R1(config-subif)# interface g0/1.200
R1(config-subif)# encapsulation dot1q 200
R1(config-subif)# description Management VLAN
R1(config-subif)# ip address 192.168.1.65 255.255.255.224
R1(config-subif)# interface g0/1.1000
R1(config-subif)# encapsulation dot1q 1000 native
R1(config-subif)# description Native VLAN
```

## **c. Проверьте, что подинтерфейсы находятся в рабочем состоянии.**

```
 show ip interface brief
```
```
R1#sho ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         unassigned      YES unset  administratively down down
GigabitEthernet0/1         unassigned      YES unset  up                    up
GigabitEthernet0/1.100     192.168.1.1     YES manual up                    up
GigabitEthernet0/1.200     192.168.1.65    YES manual up                    up
GigabitEthernet0/1.1000    unassigned      YES unset  up                    up
GigabitEthernet0/2         unassigned      YES unset  administratively down down
GigabitEthernet0/3         unassigned      YES unset  administratively down down
```